In [61]:
import pandas as pd
import numpy as np

In [62]:
df = pd.read_csv('Week1_GA_dataset.csv')

## 1
    Select all the even indexed rows from the given dataset. What is the value in the 3rd indexed column of the 0th indexed row in the selected dataframe. (row/ column indexed from zero(0) in python/pandas)

In [63]:
even_index = df.iloc[::2]

In [64]:
ans = even_index.iloc[0,3]
ans

111440.0

## 2

    Select all the even indexed rows from the given dataset. What is the value in the 3rd indexed column of the 332th indexed row in the selected dataframe. (row/ column indexed from zero(0))

In [65]:
even_index.head(3)

,Date,Year,Locality,Estimated Value,Sale Price,Property,Residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,Face
0,2009-01-02,2009,Waterbury,111440.0,185000.0,Single Family,Detached House,3,3,996.0,1.025953,South
2,2009-01-02,2009,Waterbury,55720.0,140000.0,Single Family,Detached House,3,2,910.0,1.025953,South
4,2009-01-02,2009,Bridgeport,112351.0,210000.0,?,Detached House,3,2,1092.0,1.025953,East

In [66]:
ans = even_index.iloc[332,3]
ans

256200.0

## 3
    Select all the odd indexed rows from the given dataset. What is the value in the 3rd indexed column of the 332th indexed row in the selected dataframe. (row/ column indexed from zero(0))
    Please consider case sensitivity while giving your solution capital letter â‰  small letter
    If it is a string don't write quotes in the solution.

In [67]:
odd_index = df[1::2]

In [68]:
odd_index.head(3)

,Date,Year,Locality,Estimated Value,Sale Price,Property,Residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,Face
1,2009-01-02,2009,Bridgeport,124670.0,150000.0,Two Family,Duplex,4,3,1241.0,1.025953,South
3,2009-01-02,2009,Bridgeport,4775276.0,272900.0,Single Family,Detached House,3,1,971.0,1.025953,East
5,2009-01-02,2009,Greenwich,2868880.0,3300000.0,Single Family,Detached House,3,1,1039.0,1.025953,North

In [69]:
odd_index.iloc[332,3]

352940.0

## 4
    Select all the odd indexed columns from the given dataset. What is the value in the 5th indexed column of the 100th indexed row in the selected dataframe. (row/ column indexed from zero(0))
    Please consider case sensitivity while giving your solution capital letter â‰  small letter
    If it is a string don't write quotes in the solution.

A) Single Family

B) West

C) 2022

D) Detached House

In [70]:
odd_index.iloc[100,5]

'Single Family'

## 5
    Select all the even indexed columns and even indexed rows from the given dataset. What is the value in the 3th indexed column of the 255th indexed row in the selected dataframe. (row/ column indexed/starts from zero(0))
    Please consider case sensitivity while giving your solution capital letter â‰  small letter
    If it is a string don't write quotes in the solution.


A) Single Family

B) West

C) 2022

D) Detached House

In [71]:
df.head(3)

,Date,Year,Locality,Estimated Value,Sale Price,Property,Residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,Face
0,2009-01-02,2009,Waterbury,111440.0,185000.0,Single Family,Detached House,3,3,996.0,1.025953,South
1,2009-01-02,2009,Bridgeport,124670.0,150000.0,Two Family,Duplex,4,3,1241.0,1.025953,South
2,2009-01-02,2009,Waterbury,55720.0,140000.0,Single Family,Detached House,3,2,910.0,1.025953,South

In [77]:
condition = df.iloc[ : :2 , ::2]
condition.iloc[225]

Date                 2009-07-10
Locality              Fairfield
Sale Price             430000.0
Residential              Duplex
num_bathrooms                 2
property_tax_rate      1.025953
Name: 450, dtype: object

In [74]:
ans = condition.iloc[225,3]
ans

'Duplex'

## 6

    Determine the number of samples (rows) in the dataset that belong to the six most recent years, based on the provided data.

In [80]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Date               10000 non-null  object
 1   Year               10000 non-null  int64
 2   Locality           8747 non-null   object
 3   Estimated Value    8757 non-null   float64
 4   Sale Price         10000 non-null  float64
 5   Property           10000 non-null  object
 6   Residential        10000 non-null  object
 7   num_rooms          10000 non-null  int64
 8   num_bathrooms      10000 non-null  int64
 9   carpet_area        8771 non-null   float64
 10  property_tax_rate  10000 non-null  float64
 11  Face               10000 non-null  object
dtypes: float64(4), int64(3), object(5)
memory usage: 937.6+ KB

In [90]:
recent_year = sorted(df['Year'].unique())[-6:]
recent_year

[2017, 2018, 2019, 2020, 2021, 2022]

In [96]:
recent_rows = df[df['Year'].isin(recent_year)]

In [95]:
len(recent_rows)

4749

## 7
    Determine the number of samples (rows) in the dataset which has num_rooms = 3 and num_bathrooms = 3